src/cf/InformationRegisters/РасчетНалогаАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РасчетНалогаАУСН</Name>
			<Comment>Расчет суммы налога при АУСН, выполненный  налоговым органом</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектыНалогообложенияПоУСН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗапроса</Name>
					<Comment>UTC</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредварительныйРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНачисления</Name>
					<Comment>указывает на источник детальных данных расчета в НалоговыеНачисленияАУСН</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторНачисленияАУСН</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговыйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НалоговыеНачисленияАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НалоговыеНачисленияАУСН</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалоговыхНачисленийАУСН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Начислено</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оплачено</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Уменьшено</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетНалога</Name>
					<Comment>json-представление данных объекта Estimations протокола обмена ПП АУСН</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗапроса</Name>
					<Comment>UTC</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВОбработке</Name>
					<Comment>Обрабатывается налоговым органом и еще не влияет на сальдо расчетов с бюджетом</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговыйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНачисления</Name>
					<Comment>в ПП АУСН ФНС</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторНачисленияАУСН</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ОбъектыНалогообложенияПоУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ОбъектыНалогообложенияПоУСН</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыМинусРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/РасчетНалогаАУСН/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает данные о налоге АУСН за указанный период, начисленном ФНС.
//
// Параметры:
//  Организация - ОпределяемыйТип.Организация - организация, для которой нужны данные.
//  Период      - Дата - начало месяца, за который нужны данные.
// 
// Возвращаемое значение:
//  Структура - См. НовыйДанныеРасчета.
//
Функция ДанныеЗаПериод(Организация, Период) Экспорт
	
	ДанныеРасчета = НовыйДанныеРасчета();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",      НалоговыйПериод(Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Расчет.Сумма КАК Сумма,
	|	Расчет.НалоговыйПериод КАК Период,
	|	Расчет.ДатаЗапроса КАК ДатаРасчета,
	|	Расчет.ПредварительныйРасчет КАК ПредварительныйРасчет,
	|	Расчет.ОбъектНалогообложения КАК ОбъектНалогообложения,
	|	Расчет.СтавкаНалога КАК СтавкаНалога,
	|	Расчет.Доходы КАК Доходы,
	|	Расчет.Расходы КАК Расходы,
	|	Расчет.ИдентификаторНачисления КАК Источник,
	|	Расчет.Ошибки КАК Ошибки
	|ИЗ
	|	РегистрСведений.РасчетНалогаАУСН КАК Расчет
	|ГДЕ
	|	Расчет.Организация = &Организация
	|	И Расчет.НалоговыйПериод = &Период";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеРасчета, Выборка);
	КонецЕсли;
	
	Возврат ДанныеРасчета;

КонецФункции

// Определяет допустимые значения поля НалоговыйПериод
//
// Параметры:
//  Период - Дата - обозначает налоговый период (месяц)
// 
// Возвращаемое значение:
//  Дата
//
Функция НалоговыйПериод(Период) Экспорт
	Возврат НачалоМесяца(Период);
КонецФункции

// Выполняет обновление данных регистра из загруженных данных сервиса АУСН
//
// Параметры:
//  Расчет - см. РегистрыСведений.НалоговыеНачисленияАУСН.НовыйРасчетНалога - записываемые данные
//  НалоговыйПериод - Дата
//  Организация  - СправочникСсылка.Организации
//  ИдентификаторНачисления - ОпределяемыйТип.ИдентификаторНачисленияАУСН - источник записываемых данных
//  ДатаЗапроса - Дата - дата UTC, на которую расчет актуален
//
Процедура ЗаписатьРасчет(Расчет, НалоговыйПериод, Организация, ИдентификаторНачисления, ДатаЗапроса) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(Запись, Расчет);
	
	Запись.НалоговыйПериод = НалоговыйПериод;
	Запись.Организация = Организация;
	Запись.ИдентификаторНачисления = ИдентификаторНачисления;
	Запись.ДатаЗапроса = ДатаЗапроса;
	
	Запись.Записать(Истина);
	
КонецПроцедуры

// Записывает ошибку, полученную из сервиса АУСН
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//  НалоговыйПериод - Дата
//  Ошибки - Строка - содержание ошибки
//
Процедура ЗаписатьОшибку(Организация, НалоговыйПериод, Ошибки) Экспорт
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Организация.Установить(Организация);
	Набор.Отбор.НалоговыйПериод.Установить(НалоговыйПериод);
	Запись = Набор.Добавить();
	Запись.Организация = Организация;
	Запись.НалоговыйПериод = НалоговыйПериод;
	Запись.Ошибки = Ошибки;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

// Определяет детальные данные расчета налога.
//
// Параметры:
//  Период - Дата - определяет налоговый период (месяц), за который выполняется расчет
//  Организация - СправочникСсылка.Организации - налогоплательщик
//  ИдентификаторНачисления - ОпределяемыйТип.ИдентификаторНачисленияАУСН - источник детальных данных в информационных системах ФНС
// 
// Возвращаемое значение:
//  Структура - см. НовыйРасчетНалога
//
Функция ДетальныеДанныеРасчета(Период, Организация, ИдентификаторНачисления) Экспорт
	
	Возврат РегистрыСведений.НалоговыеНачисленияАУСН.НайтиДанныеРасчетаНалога(
		Период,
		Организация,
		ИдентификаторНачисления);
	
КонецФункции

#Область ПодключениеПодсистем
// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//  Ограничение - См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом
#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Конструктор данных расчета
//
// Возвращаемое значение:
//  Структура
//
Функция НовыйДанныеРасчета()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Сумма",                 0);
	Результат.Вставить("Период",                '00010101');
	Результат.Вставить("ДатаРасчета",           '00010101');
	Результат.Вставить("ДатаЗапроса",           '00010101');
	Результат.Вставить("ПредварительныйРасчет", Ложь);
	Результат.Вставить("ОбъектНалогообложения", Перечисления.ОбъектыНалогообложенияПоУСН.ПустаяСсылка());
	Результат.Вставить("СтавкаНалога",          0);
	Результат.Вставить("Доходы",                0);
	Результат.Вставить("Расходы",               0);
	Результат.Вставить("Источник",              0);
	Результат.Вставить("Ошибки",                "");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
